app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "remember_token", "email") VALUES('Ginger', 'a9bd3230cd8fa64046c5012ff88e2d7e50f7fc4df29412bd6e42a5049735250e', 'f0a162d69c2c48d4eb064bc60521313e52c861d8e61938c1d7a42cd38fabfad0', '2010-10-02 16:03:46', '2010-10-02 16:03:46', NULL, 'ginger@email.com')